---
kind: property
id: P:Autodesk.Revit.DB.EdgeArrayArray.Size
source: html/d9503f44-059a-746a-520f-fb0581289d93.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.Size Property

Returns the number of edge arrays that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```